{
  "subreddit": "housemd",
  "posts": [
    {
      "post": "Kindly follow the subreddit rules going forward!",
      "caption": "Hi All,\n\nPosts/Comments will be moderated from today and if it's not adhering to the subreddit's rules, they will be removed. We've a good community here for one of the best TV shows and would like to keep it that way although it wasnt the case since this sub is created.\n\nI've approved most of the posts/comments which were queued for approval since there were no subreddit rules to adhere to, however it will not be the case now.\n\nIf there are any suggestions, would love to hear them but it's upto us mods to decide\n\nHave a good day!",
      "username": "AutoModerator",
      "comments": [
        {
          "username": "electricmohair",
          "comment": "Don’t know how others feel about this but my suggestion would be to forget the need for spoiler tags. The show ended 10 years ago, it seems unnecessary to have them at this point, from what I’ve seen it’s unusual on Reddit to keep them around for so long as it can make posting more awkward."
        },
        {
          "username": "JayandSilentB0b",
          "comment": "Gotta ask the important question: what is the official stance on Fivemann posts going forward?"
        },
        {
          "username": "Ornlu96",
          "comment": "I don't know where to ask this but can someone help me find that (probably tiktok) video of a person parodying House and diagnosing himself with cold? I know it was posted in this subreddit."
        },
        {
          "username": "EM4em9",
          "comment": "A probably silly question, but how do you make spoiler tags? Is that in the FAQ?"
        },
        {
          "username": "AlertSet8828",
          "comment": "Just assuming.. it's not really you I'm talking too!! But anyway, for my own amusement.. I'm your biggest fan.. if you ever come to Tomball Texas.. email me..Bro"
        }
      ]
    },
    {
      "post": "I made a house quote searcher",
      "caption": "Have seen a lot of posts in this sub asking about where a certain quote is from, so I thought I would make a website to help find them. Link to the website is in comments, it uses a vector database to find the quotes which lets it find similar results to what you're searching for, although it does end up missing some of the time. Was a pretty fun project to work on, and I'll probably add more features to it in the future if they're wanted\n\nhttps://preview.redd.it/h5azu5ncfo7c1.png?width=834&format=png&auto=webp&s=1fe70427119d53a1944776d2f2c2136db1241423\n\nhttps://preview.redd.it/57yy5kidfo7c1.png?width=1246&format=png&auto=webp&s=cb27cf89193a73cd0f7249d30e10160f79edfd30\n\nhttps://preview.redd.it/jisp0dbhfo7c1.png?width=1338&format=png&auto=webp&s=6b484f62ec984d2d78abeb044a5b789ad8016c4a\n\n&#x200B;",
      "username": "deotime",
      "comments": [
        {
          "username": "StonedSanta1705",
          "comment": "That is insane oh my god. Great job"
        },
        {
          "username": "deotime",
          "comment": "[Link to website](https://housemd-quotes.com/)"
        },
        {
          "username": "viktorzokas",
          "comment": "Loved to see one of my favourite underappreciated quotes turn up in the search.\n\n\"Well, they got four legs. Think on how fast it should work one one!\"\n\nGreat work!"
        },
        {
          "username": "DangIsThatAGiraffe",
          "comment": "I can now see if my favourite medical conditions were referenced in house"
        },
        {
          "username": "iamwiththebanned",
          "comment": "This is amazing. If you had a tip jar, I would donate. I was able to find the exact quote I was looking for with one word.\n\n“\"You're nuts. You're going to be miserable, at home, at work, somewhere. The goal in life is not to eliminate misery, it's to keep misery to the minimum.\"”"
        }
      ]
    },
    {
      "post": "Is Dr.James Wilson real",
      "caption": "Just started the show, on ep 5. Wilson hasn't interacted with anyone except House. He is in the background suggesting ideas in one scene but only house responds. He always appears in Houses moments of doubt and tells him to do the opposite of what he wants to accomplish (ex. Give up, let it go, etc.) I feel like he's either an angel that only house can see and is testing his will as a doctor, or house is bipolar. ",
      "username": "Mr-Asskick",
      "comments": [
        {
          "username": "Mohamed_Ibrahim18",
          "comment": "He is definitely real. Other characters interact with him throughout the rest of the show.\n\nAlthough, I have to ask, if he wasn't real, why would you want to know that now? If you're assuming him not being real is some sort of twist the show was trying to pull, wouldn't asking about it be a spoiler for you?"
        },
        {
          "username": "sleepysnafu",
          "comment": "That would’ve been a really cool twist but no"
        },
        {
          "username": "Sebruhoni",
          "comment": "Off of the top of my head, he interacts with the rest of the team and the patient in Episode 1. Most clearly when Foreman calls him a liar for saying he was related to the patient and then Wilson calls her by the wrong name, which Foreman also calls out."
        },
        {
          "username": "Lyri3sh",
          "comment": "LMAO that reminds me for the fiest few episodes I didnt understand why he wasnt always with the team (ie during ddx or running the tests) but was often present with them otherwise"
        },
        {
          "username": "Honka_Ponka",
          "comment": "No, he's not real. The show makes it painfully obvious from episode 1. If you're having trouble understanding this, you're going to HATE the Into The Houseverse arc."
        }
      ]
    },
    {
      "post": "Poor, Wilson. Always had it rough.",
      "caption": "",
      "username": "Prideofgryffindor-",
      "comments": [
        {
          "username": "CheckRaiseMe",
          "comment": "He's lucky he didn't get a foot in his ass."
        },
        {
          "username": "Jaclark548",
          "comment": "Hey, isn’t that Dave Matthews’ dad?"
        },
        {
          "username": "Hideous-Kojima",
          "comment": "For real though, they should have filmed a scene in his episode just for the out-takes where he goes \"Well well, look who's a doctor and not working in theater. Dumbass.\"\n\nMind you, I also wanted him to call Mulder a dumbass when he appeared on X-Files. I just want a Kurtwood Smith calling people dumbass cinematic universe."
        },
        {
          "username": "Pale_Difference_9949",
          "comment": "Real talk though I love to fantasise the ending of DPS didn’t happen and he really did go to medical school and became Wilson"
        },
        {
          "username": "Johnnyonoes",
          "comment": "Damn, Red"
        }
      ]
    },
    {
      "post": "I'm on season 4 and I miss this",
      "caption": "",
      "username": "LiveFast3atAss",
      "comments": [
        {
          "username": "ValuableMuch7703",
          "comment": "Don't be sad.\n\n>!Everyone comes back. Chase and Cameron initially make guest appearances in most episodes, later Chase becomes a regular cast, a member of the diagnostic team once again in later seasons. Foreman leaves for a few episodes, he'll be back in the core team within 2-3 Episodes!<"
        },
        {
          "username": "Bright_Possible4124",
          "comment": "They will come back, don’t worry!"
        },
        {
          "username": "ahm-i-guess",
          "comment": "honestly, same, i love the new team (it took a little bit but two of the three are my absolute faves) but you can't beat the og's :("
        },
        {
          "username": "Hukares1234",
          "comment": "I’ve rewatched the series a few times and I agree with you. The OG team is the best. But the new characters add some flavor to the show."
        },
        {
          "username": "No_Post491",
          "comment": "I felt the same as I started season 4. Later I grew fond of the new crew and even the >!next one after them!<. If it were all one crew for all 8 seasons it would get boring, it's good to have new characters to bring some freshness into the show. And you will grow to like them (yeah, even Taub)"
        }
      ]
    }
  ]
}